const QuoteList = [
    'کست خوردن سخت است اما سخت تر از شکست آن است که هرگز برای موفقیت تلاش نکنیم.',
    'من امروز انسان موفقی هستم زیرا دوستی داشتم که به من اعتقاد داشت و نمی خواستم او را نا امید کنم.  ',
    'اجازه دهید همیشه با لبخند با هم روبرو شویم، زیرا لبخند سرآغاز عشق است.  ',
    'انتخاب هایی که در طول زندگی می کنیم بیشتر از توانایی های ما حقیقت وجودی مان را نشان می دهند.   ',
    'فقط زمانی کاری را به فردا موکول کن که برایت اهمیت نداشته باشد که بمیری و انجامش نداده باشی.  ',
    'اگر می خواهی خوشحال باشی، پس باش.  ',
    'اغلب شکست های زندگی برای افرادی رخ داده که موقع تسلیم شدن نمی دانستند چقدر به موفقیت نزدیک شده اند.  ',
    'اگر می خواهید زندگی شادی داشته باشید، زندگی خود را به یک هدف گره بزنید نه آدم ها و چیزها.  ',
    'اگر کارتان خوردن یک قورباغه است بهتر است اول صبح انجامش دهید، اگر کارتان خوردن دو قورباغه است، بهتر است ابتدا قورباغه بزرگ تر را بخورید.”',
    'آنچه را که به آن علاقه دارید پیدا کنید، در آن خبره شود سپس کسی را پیدا کنید که به خاطر آن تخصص به شما دستمزد دهد.  ',
    'زندگی همه انسان ها یکسان به پایان می رسد، تنها نحوه زندگی کردن و نحوه مرگ افراد است که باعث تمایز آن فرد با دیگران می شود.  ”',
    'هر کاری که می توانید یا آرزوی انجام دادنش را دارید شروع کنید زیرا جسارت با خود نبوغ، قدرت و جادو به همراه می آورد.  ',
    'معتقدم هر کسی قدرت درونی ای دارد که برنده و بازنده را می سازد و برنده ها کسانی هستند که واقعا به حقیقت قلب شان گوش می دهند.”',
    'در زندگی مهم این نیست که به ایده آل زندگی تان برسید، بلکه مهم این است که در مسیر رسیدن به ایده آل زندگی تان حرکت کنید.    '   
]
const AutherName = [
    "تئودور روزولت",
    "آبراهام لینکلن",
    "مادر ترزا",
    "جی کی رولینگ",
    "پابلو پیکاسو",
    "لئو تولستوی",
    "توماس ادیسون",
    " آلبرت انیشتین",
    "مارک تواین",
    "کاترین وایتهورن",
    "ارنست همینگوی",
    "ولفانگ گوته",
    "سیلوستر استالونه",
    "دکتر الهی قمشه ای"
]
let QuoteParagraph = document.getElementById("quote")
let QuoteAuther = document.getElementById("quote-auther")

function GoToNextQuote() {
    const randomNumber = Math.floor(Math.random() * QuoteList.length) 
    QuoteParagraph.innerText = QuoteList[randomNumber]
    QuoteAuther.innerText = AutherName[randomNumber]
}


// نوشته شده توسط مهدی در پایان چند روز یادگیری جاوااسکریپت